OpenFOAM/freeSurfaceFlows-0F4.1/cases/spillway-4.1/0.org/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletAir
    {
//	type		zeroGradient;
        type            fixedFluxPressure;
    }
    
    inletWater
    {
//	type		zeroGradient;
        type            fixedFluxPressure;
    }
    
    outlet
    {
        type            fixedFluxPressure;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
        U               U;
        phi             phi;
        rho             rho;
        psi             none;
        gamma           1;
        value           uniform 0;
    }
    
    bottomWall
    {
        type            fixedFluxPressure;
    }
    
    dam
    {
        type            fixedFluxPressure;
    }

    front
    {
        type            empty;
    }
    
    back
    {
        type            empty;
    }
    
    defaultFaces
    {
        type            empty;
    }
    
}

// ************************************************************************* //
